{{-- 
    Проект: toskt-web
    Файл: footer_full.blade.php
    Автор: Copyright (c) 2026, Фесянов Илья (Fesyanov Ilya)
--}}    
    
    <footer>
        <div class="flex flex-col justify-between bg-[#0099ff]/80 backdrop-blur-xl mt-4 sm:mt-2 p-3 sm:p-5 mb-5 mx-auto rounded-xl shadow-xl max-w-370">
            <div class="flex justify-center items-center gap-5 pt-5">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor" class="h-15 text-white">
                    <path d="M16.5 7.5h-9v9h9v-9Z" />
                    <path fill-rule="evenodd" d="M8.25 2.25A.75.75 0 0 1 9 3v.75h2.25V3a.75.75 0 0 1 1.5 0v.75H15V3a.75.75 0 0 1 1.5 0v.75h.75a3 3 0 0 1 3 3v.75H21A.75.75 0 0 1 21 9h-.75v2.25H21a.75.75 0 0 1 0 1.5h-.75V15H21a.75.75 0 0 1 0 1.5h-.75v.75a3 3 0 0 1-3 3h-.75V21a.75.75 0 0 1-1.5 0v-.75h-2.25V21a.75.75 0 0 1-1.5 0v-.75H9V21a.75.75 0 0 1-1.5 0v-.75h-.75a3 3 0 0 1-3-3v-.75H3A.75.75 0 0 1 3 15h.75v-2.25H3a.75.75 0 0 1 0-1.5h.75V9H3a.75.75 0 0 1 0-1.5h.75v-.75a3 3 0 0 1 3-3h.75V3a.75.75 0 0 1 .75-.75ZM6 6.75A.75.75 0 0 1 6.75 6h10.5a.75.75 0 0 1 .75.75v10.5a.75.75 0 0 1-.75.75H6.75a.75.75 0 0 1-.75-.75V6.75Z" clip-rule="evenodd" />
                </svg>
                <h2 class="text-xl font-bold text-white">Отдел технического обеспечения и сопровождения компьютерной техники</h2>
            </div>  
            <div class="flex justify-center mt-2 gap-5">
                <div class="flex flex-col gap-1 p-5">
                    <h2 class="text-xl font-bold text-white">Обслуживаемые здания</h2>
                    <p class="text-lg font-bold text-white">Учебно-лабораторный комплекс - 1 (УЛК-1)</p>
                    <p class="text-base text-white">1/18 (пр. Мира 68/19)</p>
                    <p class="text-lg font-bold text-white">Учебно-лабораторный комплекс - 2 (УЛК-2)</p>
                    <p class="text-base text-white">пр. Мира 13, 4-х этажное здание</p>
                    <p class="text-lg font-bold text-white">Учебно-лабораторный комплекс - 3 (УЛК-3)</p>
                    <p class="text-base text-white">ГЭС, 9/10, (пр.Ямашева, д.33)</p>
                    <p class="text-lg font-bold text-white">Учебно-лабораторный комплекс - 4 (УЛК-4)</p>
                    <p class="text-base text-white">улица Ш. Усманова д.18, 2-х этажное здание</p>
                    <p class="text-lg font-bold text-white">Учебно-лабораторный комплекс - 5 (УЛК-5)</p>
                    <p class="text-base text-white">Адрес: пр. Мира, 13б</p>
                    <p class="text-lg font-bold text-white">Учебно-лабораторный комплекс - 6 (УЛК-6)</p>
                    <p class="text-base text-white">11/29 (пр. Сююмбике 10А)</p>
                    <p class="text-lg font-bold text-white">Учебно-лабораторный комплекс - 7 (УЛК-7)</p>
                    <p class="text-base text-white">1/15 (улица академика Рубаненко, 10)</p>
                </div>
                <div class="flex flex-col gap-1 p-5">
                    <h2 class="text-xl font-bold text-white">Сотрудники</h2>
                    <a href="" class="text-base text-white">Общая информация</a>
                    <a href="" class="text-base text-white">База знаний</a>
                    <a href="" class="text-base text-white">Инвентаризация</a>
                </div>
                <div class="flex flex-col gap-1 p-5">
                    <h2 class="text-xl font-bold text-white">Клиенты и поставщики</h2>
                    <a href="" class="text-base text-white">Интеграции</a>
                    <a href="" class="text-base text-white">Договоры</a>
                    <a href="" class="text-base text-white">Лицензии ПО</a>
                </div>
                <div class="flex flex-col gap-1 p-5">
                    <h2 class="text-xl font-bold text-white">Наш отдел</h2>
                    <a href="" class="text-base text-white">Разработки</a>
                    <a href="" class="text-base text-white">Статистика</a>
                    <div class="flex mt-2">
                        <svg xmlns="http://www.w3.org/2000/svg" width="42" height="42" viewBox="0 0 42 42" fill="none">
                            <path d="M7.455 7.455C5.25 9.681 5.25 13.2405 5.25 20.37V21.63C5.25 28.749 5.25 32.3085 7.455 34.545C9.681 36.75 13.2405 36.75 20.37 36.75H21.63C28.749 36.75 32.3085 36.75 34.545 34.545C36.75 32.319 36.75 28.7595 36.75 21.63V20.37C36.75 13.251 36.75 9.6915 34.545 7.455C32.319 5.25 28.7595 5.25 21.63 5.25H20.37C13.251 5.25 9.6915 5.25 7.455 7.455ZM10.563 14.8365H14.175C14.2905 20.8425 16.9365 23.3835 19.0365 23.9085V14.8365H22.428V20.013C24.4965 19.7925 26.6805 17.43 27.4155 14.826H30.7965C30.5206 16.1739 29.9699 17.4504 29.1786 18.5759C28.3873 19.7014 27.3725 20.6517 26.1975 21.3675C27.509 22.02 28.6672 22.9433 29.5957 24.0763C30.5242 25.2093 31.2019 26.5263 31.584 27.9405H27.8565C27.0585 25.452 25.0635 23.52 22.428 23.2575V27.9405H22.008C14.826 27.9405 10.731 23.0265 10.563 14.8365Z" fill="white"></path>
                        </svg>
                        <svg xmlns="http://www.w3.org/2000/svg" width="43" height="42" viewBox="0 0 43 42" fill="none">
                            <path d="M21.5026 3.5C11.6126 3.5 3.58594 11.34 3.58594 21C3.58594 30.66 11.6126 38.5 21.5026 38.5C31.3926 38.5 39.4193 30.66 39.4193 21C39.4193 11.34 31.3926 3.5 21.5026 3.5ZM29.8159 15.4C29.5472 18.165 28.3826 24.885 27.7914 27.9825C27.5405 29.295 27.0389 29.7325 26.573 29.785C25.5339 29.8725 24.7455 29.12 23.7422 28.4725C22.1655 27.4575 21.2697 26.8275 19.7468 25.8475C17.973 24.71 19.1197 24.08 20.1409 23.065C20.4097 22.8025 24.9964 18.725 25.0859 18.3575C25.0984 18.3018 25.0967 18.2441 25.0811 18.1892C25.0655 18.1343 25.0364 18.0839 24.9964 18.0425C24.8889 17.955 24.7455 17.99 24.6201 18.0075C24.4589 18.0425 21.9505 19.67 17.0593 22.89C16.3426 23.3625 15.6976 23.6075 15.1243 23.59C14.4793 23.5725 13.2609 23.24 12.3472 22.9425C11.2184 22.5925 10.3405 22.4 10.4122 21.7875C10.448 21.4725 10.8959 21.1575 11.738 20.825C16.9697 18.6025 20.4455 17.1325 22.1834 16.4325C27.1643 14.4025 28.1855 14.0525 28.8664 14.0525C29.0097 14.0525 29.3501 14.0875 29.5651 14.2625C29.7443 14.4025 29.798 14.595 29.8159 14.735C29.798 14.84 29.8339 15.155 29.8159 15.4Z" fill="white"></path>
                        </svg>
                        <svg xmlns="http://www.w3.org/2000/svg" width="43" height="42" viewBox="0 0 1521.32 1516.58" fill="none">			
                            <path fill="white" d="M772.44 1295.02c-107.13,0 -156.91,-15.6 -243.19,-77.99 -54.92,70.2 -227.77,124.81 -235.38,31.2 0,-70.14 -15.84,-129.23 -33.31,-194.26 -21.38,-79.69 -45.16,-168.33 -45.16,-297.16 0,-307.17 253.55,-538.24 554.22,-538.24 300.58,0 536.3,242.3 536.3,541.23 0,298.89 -243.23,535.23 -533.49,535.23l0.01 -0.01zm4.34 -810.86c-146.28,-7.62 -260.42,93.24 -285.6,251.11 -20.87,130.76 16.11,290.06 47.72,298.07 14.92,3.78 53.1,-26.92 76.62,-50.31 38.73,24.94 83.14,44.28 132.52,46.82 150.2,7.82 283.26,-108.97 291.15,-258.22 7.88,-149.25 -112.21,-279.65 -262.39,-287.47l-0.02 0z"></path>
                        </svg>
                    </div>
                </div>
            </div>
        </div>
        <div class="flex justify-center gap-5 max-w-370 item-center mx-auto mt-3 mb-5">
            <p class="text-xs text-white font-bold">© Набережночелнинский институт КФУ</p>
            <p class="text-xs text-white font-bold">Email разработчика: IAFesyanov@kpfu.ru</p>
        </div>
    </footer>